#### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_config_config_rule.example will be created
  + resource "aws_config_config_rule" "example" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "example-config-rule"
      + rule_id  = (known after apply)
      + tags_all = (known after apply)

      + evaluation_mode (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_SERVER_SIDE_ENCRYPTION_ENABLED"
        }
    }

  # aws_config_configuration_recorder.example will be created
  + resource "aws_config_configuration_recorder" "example" {
      + id       = (known after apply)
      + name     = "example-recorder"
      + role_arn = (known after apply)

      + recording_group {
          + all_supported                 = true
          + include_global_resource_types = true

          + exclusion_by_resource_types (known after apply)

          + recording_strategy (known after apply)
        }

      + recording_mode (known after apply)
    }

  # aws_config_configuration_recorder_status.example will be created
  + resource "aws_config_configuration_recorder_status" "example" {
      + id         = (known after apply)
      + is_enabled = true
      + name       = "example-recorder"
    }

  # aws_config_delivery_channel.example will be created
  + resource "aws_config_delivery_channel" "example" {
      + id             = (known after apply)
      + name           = "example-delivery-channel"
      + s3_bucket_name = (known after apply)
    }

  # aws_iam_role.config_role will be created
  + resource "aws_iam_role" "config_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "config-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.config_policy will be created
  + resource "aws_iam_role_policy_attachment" "config_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSConfigRole"
      + role       = "config-role"
    }

  # aws_organizations_account.audit will be created
  + resource "aws_organizations_account" "audit" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "audit-unique@example.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "audit"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_account.logarchive will be created
  + resource "aws_organizations_account" "logarchive" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "logarchive-unique@example.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "logarchive"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_account.sandbox will be created
  + resource "aws_organizations_account" "sandbox" {
      + arn               = (known after apply)
      + close_on_deletion = false
      + create_govcloud   = false
      + email             = "sandbox-unique@example.com"
      + govcloud_id       = (known after apply)
      + id                = (known after apply)
      + joined_method     = (known after apply)
      + joined_timestamp  = (known after apply)
      + name              = "sandbox"
      + parent_id         = (known after apply)
      + status            = (known after apply)
      + tags_all          = (known after apply)
    }

  # aws_organizations_organizational_unit.audit will be created
  + resource "aws_organizations_organizational_unit" "audit" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Audit"
      + parent_id = "r-fle5"
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.logarchive will be created
  + resource "aws_organizations_organizational_unit" "logarchive" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "LogArchive"
      + parent_id = "r-fle5"
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.sandbox will be created
  + resource "aws_organizations_organizational_unit" "sandbox" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Sandbox"
      + parent_id = "r-fle5"
      + tags_all  = (known after apply)
    }

  # aws_s3_bucket.config_bucket will be created
  + resource "aws_s3_bucket" "config_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "config-bucket-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.config_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "config_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

  </details>

  *Pusher: @yahyagulshan, Action: `pull_request`, Workflow: `Terraform Plan`*